app/Controllers/CarritoController.php

INSERT INTO `ventas` (`id_usuario`, `total_venta`, `estado_venta`, `datos_cliente`, `created_at`, `updated_at`) VALUES ('29', 0, 'pendiente', '{\"nombre\":\"pancho\",\"apellido\":\"hamburguesa\",\"email\":\"correo@mememail.com\",\"dni\":\"12345678\",\"telefono\":\"1235456789\",\"direccion\":\"asdxzc\"}', '2025-06-29 22:06:17', '2025-06-29 22:06:17')
---
                'estado_venta'  => 'pendiente',
                'datos_cliente' => json_encode($datos_cliente_venta), // Almacenar todos los datos del cliente como JSON
            ];
            $id_venta = $this->ventaModel->insert($data_venta);

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '49'
---

            foreach ($items_carrito as $item) {
                // Obtener el stock actual del producto DENTRO de la transacción para la validación final
                $producto_real = $this->productoModel->find($item['id_producto']);