app/Controllers/CatalogoController.php

        $data['pager'] = $this->productoModel->pager;

        // 7. Obtener todas las categorías activas para el filtro de la vista
        $data['categorias'] = $this->categoriaModel->where('activo', 1)->orderBy('nombre', 'ASC')->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
ORDER BY `nombre` ASC

    public function detalle($id_producto = null)
    {
        if ($id_producto === null) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $producto = $this->productoModel
                            ->select('productos.*, categorias.nombre AS categoria_nombre')
                            ->join('categorias', 'categorias.id_categoria = productos.id_categoria', 'left')
                            ->find($id_producto);
---
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`id_producto` = '29'