app/Controllers/productoController.php

SELECT COUNT(*) AS `numrows`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`activo` = 1
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`activo` = 1
ORDER BY `productos`.`stock` DESC
 LIMIT 10
---
        public function index()
{
    $data = [];

    $search = $this->request->getGet('search');
    $categoriaId = $this->request->getGet('categoria');
    $orden_stock = $this->request->getGet('orden_stock') ?? 'desc'; // Solo dejamos el filtro de stock

    $filterConditions = function ($query) use ($search, $categoriaId) {
        if (!empty($search)) {
            $query->groupStart()
                  ->like('productos.nombre', $search)
                  ->orLike('productos.marca', $search)
                  ->groupEnd();
        }
        if (!empty($categoriaId)) {
            $query->where('productos.id_categoria', $categoriaId);
        }
        return $query;
    };

    // Productos activos ordenados por stock
    $queryActivos = $this->productoModel
                         ->select('productos.*, categorias.nombre AS categoria_nombre')
                         ->join('categorias', 'categorias.id_categoria = productos.id_categoria', 'left');

    $queryActivos = $filterConditions($queryActivos);

    $data['productos'] = $queryActivos
                            ->where('productos.activo', 1)
                            ->orderBy('productos.stock', $orden_stock)
                            ->paginate(10);

SELECT *
FROM `categorias`
---
    $data['search'] = $search;
    $data['selected_categoria'] = $categoriaId;
    $data['orden_stock'] = $orden_stock;
    $data['categorias'] = $this->categoriaModel->findAll();

UPDATE `productos` SET `nombre` = 'Notebook Asus  ', `marca` = 'Asus', `id_categoria` = '2', `precio` = '3000.00', `descripcion` = 'CARACTERISTICAS GENERALES\r\nColor: Gris Oscuro\r\nTipo: Notebook\r\nSistema Operativo: Windows 11 Home\r\nBatería Extraible: No\r\nIdioma Sistema Operativo: Multiples Idiomas\r\nTipo De Cpu: AMD\r\nModelo Cpu: Ryzen 7 7735HS\r\nTipo De Gpu: Nvidia GeForce\r\nModelo Gpu: GeForce RTX 4050\r\nMemoria Gpu: 6 gb\r\nLector De Huellas: No\r\nFamilia Del Procesador: AMD RYZEN 7\r\n\r\nCONECTIVIDAD\r\nPuertos Hdmi: 1\r\nPuertos Mini Hdmi: 0\r\nPuerto Mini Dp: 0\r\nPuertos Usb 2.0 Tipo A: 0\r\nPuertos Usb 3.0 Tipo A: 0\r\nPuertos Usb 3.2 Tipo A: 2\r\nPuertos Usb 3.2 Tipo C: 2\r\nPuertos Ethernet: Si\r\nBluetooth: Si\r\nWifi: Norma AX\r\nTipo De Thunderbolt: No incluye\r\n\r\nDIMENSIONES\r\nPeso: 2.2 kg\r\nAncho: 354 mm\r\nProfundidad: 250 mm\r\nAlto: 25 mm\r\n\r\nDIMENSIONES\r\nPeso: 2.2 kg\r\nAncho: 354 mm\r\nProfundidad: 250 mm\r\nAlto: 25 mm\r\n\r\nALMACENAMIENTO\r\nCapacidad Hd: 0 gb\r\nSlot M2: Si\r\nTipo De M.2: NVME\r\nCapacidad Sólido: 512 gb\r\nLector De Memorias: No\r\n\r\nPANTALLA\r\nTamaño De La Pantalla: 15.60 \"\r\nTipo De Display: IPS\r\nResolución: 2560x1440\r\nTouch: No', `stock` = '555', `activo` = 1, `imagen` = '1750784431_f8fae3595b5b0873889a.jpg'
WHERE `productos`.`id_producto` IN ('33')
---
        // Si la validación es exitosa
        try {
            if ($id_producto) {
                $this->productoModel->update($id_producto, $productData);

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '34'
SELECT *
FROM `categorias`
---
public function editar($id_producto = null)
{
    if ($id_producto === null) {
        return redirect()->to(base_url('admin/productos'))->with('error', 'ID de producto no proporcionado.');
    }

    $producto = $this->productoModel->find($id_producto);
    if (!$producto) {
        return redirect()->to(base_url('admin/productos'))->with('error', 'El producto no existe.');
    }

    $data['producto'] = $producto;
    $data['categorias'] = $this->categoriaModel->findAll();