app/Controllers/VentasController.php

            // Asegurarse de que el email_cliente sea del JSON parseado si existe, o N/A
            $venta['email_cliente'] = $venta['datos_cliente_parsed']['email'] ?? 'N/A';

            $detalle_venta = $this->detalleVentaModel->where('id_venta', $venta['id_venta'])->findAll();
---
SELECT *
FROM `detalle_venta`
WHERE `id_venta` = '36'