app/Models/CarritoModel.php

    public function getProductosCarrito($id_usuario)
    {
        return $this->select('carrito.*, productos.imagen, productos.stock as stock_actual')
                    ->join('productos', 'productos.id_producto = carrito.id_producto')
                    ->where('carrito.id_usuario', $id_usuario)
                    ->where('carrito.activo', 1)
                    ->findAll();
---
SELECT `carrito`.*, `productos`.`imagen`, `productos`.`stock` as `stock_actual`
FROM `carrito`
JOIN `productos` ON `productos`.`id_producto` = `carrito`.`id_producto`
WHERE `carrito`.`id_usuario` = '30'
AND `carrito`.`activo` = 1